In [2]:
import pandas as pd
import numpy as np

In [2]:
index = pd.date_range("1/1/2000", periods=8)

s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=["A", "B", "C"])

In [3]:
index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [4]:
s

a    1.755140
b    1.184594
c   -0.682541
d    0.692620
e   -0.335247
dtype: float64

In [5]:
df

                   A         B         C
2000-01-01  1.235500 -0.352379  1.745338
2000-01-02 -1.057879 -1.094422  0.703559
2000-01-03  0.384214 -0.493537 -0.047563
2000-01-04  0.291712 -1.026438  1.425344
2000-01-05 -0.767069  0.702705 -1.078611
2000-01-06 -0.843928 -0.508159  0.919039
2000-01-07 -0.228427 -0.281839  0.521416
2000-01-08  1.890535 -0.331977  1.085736

In [6]:
long_series = pd.Series(np.random.randn(1000))
long_series

0     -1.441064
1     -0.871899
2      2.054642
3     -0.953430
4      0.094045
         ...
995   -0.100606
996    2.151024
997    0.738507
998   -0.448476
999   -0.101272
Length: 1000, dtype: float64

In [7]:
long_series.head()

0   -1.441064
1   -0.871899
2    2.054642
3   -0.953430
4    0.094045
dtype: float64

In [8]:
long_series.tail()

995   -0.100606
996    2.151024
997    0.738507
998   -0.448476
999   -0.101272
dtype: float64

In [9]:
df[:3]

                   A         B         C
2000-01-01  1.235500 -0.352379  1.745338
2000-01-02 -1.057879 -1.094422  0.703559
2000-01-03  0.384214 -0.493537 -0.047563

In [10]:
df.columns = [x.lower() for x in df.columns]   # change the column name from capital letter to lower case letters.
df

                   a         b         c
2000-01-01  1.235500 -0.352379  1.745338
2000-01-02 -1.057879 -1.094422  0.703559
2000-01-03  0.384214 -0.493537 -0.047563
2000-01-04  0.291712 -1.026438  1.425344
2000-01-05 -0.767069  0.702705 -1.078611
2000-01-06 -0.843928 -0.508159  0.919039
2000-01-07 -0.228427 -0.281839  0.521416
2000-01-08  1.890535 -0.331977  1.085736

In [11]:
s.array

<PandasArray>
[ 1.7551404212977593,   1.184594406041222,  -0.682540519069631,
  0.6926198818969844, -0.3352471050404564]
Length: 5, dtype: float64

In [12]:
s.index.array

<PandasArray>
['a', 'b', 'c', 'd', 'e']
Length: 5, dtype: object

In [13]:
s.index.array

<PandasArray>
['a', 'b', 'c', 'd', 'e']
Length: 5, dtype: object

In [14]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [15]:
df.index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.describe()

              a         b         c
count  8.000000  8.000000  8.000000
mean   0.113082 -0.423256  0.659282
std    1.049006  0.551308  0.890953
min   -1.057879 -1.094422 -1.078611
25%   -0.786284 -0.637729  0.379171
50%    0.031643 -0.422958  0.811299
75%    0.597035 -0.319442  1.170638
max    1.890535  0.702705  1.745338

In [17]:
df.T

,2000-01-01,2000-01-02,2000-01-03,2000-01-04,2000-01-05,2000-01-06,2000-01-07,2000-01-08
a,1.235500,-1.057879,0.384214,0.291712,-0.767069,-0.843928,-0.228427,1.890535
b,-0.352379,-1.094422,-0.493537,-1.026438,0.702705,-0.508159,-0.281839,-0.331977
c,1.745338,0.703559,-0.047563,1.425344,-1.078611,0.919039,0.521416,1.085736

In [18]:
df.sort_index(axis=1, ascending=False)

                   c         b         a
2000-01-01  1.745338 -0.352379  1.235500
2000-01-02  0.703559 -1.094422 -1.057879
2000-01-03 -0.047563 -0.493537  0.384214
2000-01-04  1.425344 -1.026438  0.291712
2000-01-05 -1.078611  0.702705 -0.767069
2000-01-06  0.919039 -0.508159 -0.843928
2000-01-07  0.521416 -0.281839 -0.228427
2000-01-08  1.085736 -0.331977  1.890535

In [19]:
df.sort_values(by='b')

                   a         b         c
2000-01-02 -1.057879 -1.094422  0.703559
2000-01-04  0.291712 -1.026438  1.425344
2000-01-06 -0.843928 -0.508159  0.919039
2000-01-03  0.384214 -0.493537 -0.047563
2000-01-01  1.235500 -0.352379  1.745338
2000-01-08  1.890535 -0.331977  1.085736
2000-01-07 -0.228427 -0.281839  0.521416
2000-01-05 -0.767069  0.702705 -1.078611

In [20]:
df['a']

2000-01-01    1.235500
2000-01-02   -1.057879
2000-01-03    0.384214
2000-01-04    0.291712
2000-01-05   -0.767069
2000-01-06   -0.843928
2000-01-07   -0.228427
2000-01-08    1.890535
Freq: D, Name: a, dtype: float64

In [21]:
df[0:3]

                   a         b         c
2000-01-01  1.235500 -0.352379  1.745338
2000-01-02 -1.057879 -1.094422  0.703559
2000-01-03  0.384214 -0.493537 -0.047563

In [23]:
df["20000101":"20000105"]

                   a         b         c
2000-01-01  1.235500 -0.352379  1.745338
2000-01-02 -1.057879 -1.094422  0.703559
2000-01-03  0.384214 -0.493537 -0.047563
2000-01-04  0.291712 -1.026438  1.425344
2000-01-05 -0.767069  0.702705 -1.078611

In [25]:
df.loc[index[0]]   # select the first row

a    1.235500
b   -0.352379
c    1.745338
Name: 2000-01-01 00:00:00, dtype: float64

In [27]:
df.loc[index[3]]     # select the 4th row

a    0.291712
b   -1.026438
c    1.425344
Name: 2000-01-04 00:00:00, dtype: float64

In [26]:
df.loc[:, ['a','b']]  # select all rows with a and b column

                   a         b
2000-01-01  1.235500 -0.352379
2000-01-02 -1.057879 -1.094422
2000-01-03  0.384214 -0.493537
2000-01-04  0.291712 -1.026438
2000-01-05 -0.767069  0.702705
2000-01-06 -0.843928 -0.508159
2000-01-07 -0.228427 -0.281839
2000-01-08  1.890535 -0.331977

In [28]:
df.iloc[3]    # select the 4th row, which is the same as df.loc[index[3]]

a    0.291712
b   -1.026438
c    1.425344
Name: 2000-01-04 00:00:00, dtype: float64

In [29]:
df.iloc[3:5, 0:2]  # select 4th, 5th row, and 1st and 2nd column. excluding the 6th row and 3rd column

                   a         b
2000-01-04  0.291712 -1.026438
2000-01-05 -0.767069  0.702705

In [30]:
df.iloc[[1, 2, 4], [0, 2]]   # select individual row / column

                   a         c
2000-01-02 -1.057879  0.703559
2000-01-03  0.384214 -0.047563
2000-01-05 -0.767069 -1.078611

In [31]:
df.iloc[1:3, :]   # slicing rows

                   a         b         c
2000-01-02 -1.057879 -1.094422  0.703559
2000-01-03  0.384214 -0.493537 -0.047563

In [32]:
df.iloc[:, 1:3]    # slicing columns

                   b         c
2000-01-01 -0.352379  1.745338
2000-01-02 -1.094422  0.703559
2000-01-03 -0.493537 -0.047563
2000-01-04 -1.026438  1.425344
2000-01-05  0.702705 -1.078611
2000-01-06 -0.508159  0.919039
2000-01-07 -0.281839  0.521416
2000-01-08 -0.331977  1.085736

In [33]:
df[df["a"]>0]  # boolean indexing

                   a         b         c
2000-01-01  1.235500 -0.352379  1.745338
2000-01-03  0.384214 -0.493537 -0.047563
2000-01-04  0.291712 -1.026438  1.425344
2000-01-08  1.890535 -0.331977  1.085736

In [34]:
df[df>0]

                   a         b         c
2000-01-01  1.235500       NaN  1.745338
2000-01-02       NaN       NaN  0.703559
2000-01-03  0.384214       NaN       NaN
2000-01-04  0.291712       NaN  1.425344
2000-01-05       NaN  0.702705       NaN
2000-01-06       NaN       NaN  0.919039
2000-01-07       NaN       NaN  0.521416
2000-01-08  1.890535       NaN  1.085736

In [60]:
df3= pd.DataFrame(np.random.randn(6, 4), index=pd.date_range(start='1/1/2013',end='1/6/2013'), columns=["A", "B", "C", "D"])
df3['E']=["one", "one", "two", "three", "four", "three"]

In [61]:
df3

                   A         B         C         D      E
2013-01-01  0.777342 -0.070184  1.043270 -1.146932    one
2013-01-02  0.455818 -1.938851 -1.409870  0.446874    one
2013-01-03 -0.162799 -0.670311 -0.981135  0.012618    two
2013-01-04  1.675102  0.454814  0.395843  0.258804  three
2013-01-05 -1.685776 -0.656334 -0.550516 -1.382059   four
2013-01-06 -1.040967  1.311267 -0.954945 -0.704242  three

In [67]:
df3[df3["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -0.162799 -0.670311 -0.981135  0.012618   two
2013-01-05 -1.685776 -0.656334 -0.550516 -1.382059  four

In [59]:
pd.date_range?

In [64]:
s = pd.Series(['lama', 'cow', 'lama', 'beetle', 'lama',
               'hippo'], name='animal')
s

0      lama
1       cow
2      lama
3    beetle
4      lama
5     hippo
Name: animal, dtype: object

In [65]:
s.isin(['cow', 'lama'])

0     True
1     True
2     True
3    False
4     True
5    False
Name: animal, dtype: bool

In [66]:
df2["E"]

0     test
1    train
2     test
3    train
Name: E, dtype: category
Categories (2, object): ['test', 'train']

In [69]:
df

                   a         b         c
2000-01-01  1.235500 -0.352379  1.745338
2000-01-02 -1.057879 -1.094422  0.703559
2000-01-03  0.384214 -0.493537 -0.047563
2000-01-04  0.291712 -1.026438  1.425344
2000-01-05 -0.767069  0.702705 -1.078611
2000-01-06 -0.843928 -0.508159  0.919039
2000-01-07 -0.228427 -0.281839  0.521416
2000-01-08  1.890535 -0.331977  1.085736

In [71]:
df["d"] = ["one", "one", "two", "three", "four", "three", "four", "three"]
df

                   a         b         c      d
2000-01-01  1.235500 -0.352379  1.745338    one
2000-01-02 -1.057879 -1.094422  0.703559    one
2000-01-03  0.384214 -0.493537 -0.047563    two
2000-01-04  0.291712 -1.026438  1.425344  three
2000-01-05 -0.767069  0.702705 -1.078611   four
2000-01-06 -0.843928 -0.508159  0.919039  three
2000-01-07 -0.228427 -0.281839  0.521416   four
2000-01-08  1.890535 -0.331977  1.085736  three

In [73]:
df[df['d'].isin(["four", "one"])]

                   a         b         c     d
2000-01-01  1.235500 -0.352379  1.745338   one
2000-01-02 -1.057879 -1.094422  0.703559   one
2000-01-05 -0.767069  0.702705 -1.078611  four
2000-01-07 -0.228427 -0.281839  0.521416  four

In [3]:
s = pd.Series(["String",
              (1, 2, 3),
              ["a", "b", "c"],
              123,
              -456,
              {1: "Hello", "2": "World"}])

In [4]:
s

0                        String
1                     (1, 2, 3)
2                     [a, b, c]
3                           123
4                          -456
5    {1: 'Hello', '2': 'World'}
dtype: object

In [5]:
s.str.get(1)

0        t
1        2
2        b
3      NaN
4      NaN
5    Hello
dtype: object